/*************************************************************************
	> File Name: hdu6227.cpp
	> Author: HXYerror
	> Mail: zx841985525@163.com 
	> Created Time: 2019年11月12日 星期二 21时56分35秒
 ************************************************************************/

#include <bits/stdc++.h>
#define ll  long long
using namespace std;
const int MAX = 100010;
const int INF = 0x3f3f3f3f;
const int MOD = 998244353;//998244353;

ll T,N,M,K;
/* --------------------------------------------------------------------------------------------------*/

/* --------------------------------------------------------------------------------------------------*/

int main()
{
    std::ios::sync_with_stdio(false);
    //cin.tie(0);
    //cout.tie(0);
	//in
	//out
/* --------------------------------------------------------------------------------------------------*/
    cin >> T;
    while(T--)
    {
        cin >> N;
        int a,b;
        int sum = 0;
        int x,y;
        for(int i= 0;i < N;i++)
        {
            cin >> x;
            if(i > 0) 
            {
                sum += x - y - 1;
                if(i == 1) a = x - y -1;
                if(i == N-1) b = x - y - 1;
            }
            y = x;
        }
        cout << sum - min(a,b) << "\n";
    }
    return 0;
}

